Tekla Open API Reference for Tekla Structures 2025
RebarLapping.LapPlacement Property
 Gets or sets the placement of the lap relative to the associated RebarLegFace.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLapping.LapPlacementEnum LapPlacement { get; set; }
Public Property LapPlacement As RebarLapping.LapPlacementEnum
	Get
	Set
Property Value
Type: RebarLapping.LapPlacementEnum
See Also
Reference
RebarLapping Class
Tekla.Structures.Model Namespace